Revit 2024 API
BuiltInFailures.RoomFailures.RoomNotEnclosedRooms Property
 [Room] is not in a properly enclosed region
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomNotEnclosedRooms { get; }
Visual Basic
Public Shared ReadOnly Property RoomNotEnclosedRooms As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomNotEnclosedRooms {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace